; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph3 - mode
	image0 - mode
	image2 - mode
	image1 - mode
	image4 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation1 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 image1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image0)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Planet8 spectrograph3)
	(have_image Phenomenon9 image2)
	(have_image Planet10 spectrograph3)
	(have_image Star11 image1)
	(have_image Planet12 image4)
	(have_image Phenomenon13 image4)
	(have_image Star14 image4)
	(have_image Planet15 image0)
))

)

; plan
1. (turn_to satellite0 groundstation3 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite0 star14 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star14)
   goals met: 0 of 9
5. (take_image satellite0 star14 instrument1 image4)
   added: (have_image star14 image4)
   goals met: 1 of 9
6. (turn_to satellite0 planet15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet15)
   goals met: 1 of 9
7. (take_image satellite0 planet15 instrument1 image0)
   added: (have_image planet15 image0)
   goals met: 2 of 9
8. (turn_to satellite0 planet12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet12)
   goals met: 2 of 9
9. (take_image satellite0 planet12 instrument1 image4)
   added: (have_image planet12 image4)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon13 instrument1 image4)
   added: (have_image phenomenon13 image4)
   goals met: 4 of 9
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 9
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 9
14. (turn_to satellite0 groundstation4 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation4)
   goals met: 4 of 9
15. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 4 of 9
16. (turn_to satellite0 phenomenon9 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 9
17. (take_image satellite0 phenomenon9 instrument0 image2)
   added: (have_image phenomenon9 image2)
   goals met: 5 of 9
18. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 5 of 9
19. (take_image satellite0 planet10 instrument0 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 6 of 9
20. (turn_to satellite0 planet8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet8)
   goals met: 6 of 9
21. (take_image satellite0 planet8 instrument0 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 7 of 9
22. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 7 of 9
23. (take_image satellite0 star11 instrument0 image1)
   added: (have_image star11 image1)
   goals met: 8 of 9
24. (turn_to satellite0 star5 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star5)
   goals met: 9 of 9
